app/controllers/authors/posts_controller.rb

INSERT INTO "posts" ("title", "description", "author_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "this is number 1"], ["description", "test"], ["author_id", 1], ["created_at", "2022-10-03 15:11:14.850332"], ["updated_at", "2022-10-03 15:11:14.850332"]]
---
    def create
      @post = current_author.posts.build(post_params)

      respond_to do |format|
        if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = ? AND "posts"."id" = ? LIMIT ?  [["author_id", 1], ["id", 1], ["LIMIT", 1]]
---
      def set_post
        @post = current_author.posts.find(params[:id])